Revit 2027 API
TableSectionData.SetCellStyle(Int32, TableCellStyle) Method
 Sets a column's style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellStyle(
	int nCol,
	TableCellStyle Style
)
Public Sub SetCellStyle (
	nCol As Integer,
	Style As TableCellStyle
)
public:
void SetCellStyle(
	int nCol,
	TableCellStyle^ Style
)
member SetCellStyle :
        nCol : int *
        Style : TableCellStyle -> unit
Parameters
nCol Int32
Style TableCellStyle
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
SetCellStyle Overload
Autodesk.Revit.DB Namespace